In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.__version__

'0.23.4'

In [3]:
# 2. How to create a series from a list, numpy array and dict?
li = [3,4,5,2]
np_array = np.array([3,4,6,2])
dic1 = {"name": ["amy", "ane"]}

In [6]:
type(dic1)

dict

In [8]:
ser1 = pd.Series(li)
print(type(ser1))
ser1

<class 'pandas.core.series.Series'>

0    3
1    4
2    5
3    2
dtype: int64

In [9]:
ser2 = pd.Series(np_array)
print(type(ser2))
ser2

<class 'pandas.core.series.Series'>

0    3
1    4
2    6
3    2
dtype: int64

In [10]:
ser3 = pd.Series(dic1)
print(type(ser3))
ser3

<class 'pandas.core.series.Series'>

name    [amy, ane]
dtype: object

In [11]:
# convert two lists to dictionary
dict(zip(li,np_array))

{3: 3, 4: 4, 5: 6, 2: 2}

In [13]:
df1 = pd.DataFrame()

In [14]:
df1['index'] = ser1.index

In [15]:
df1

   index
0      0
1      1
2      2
3      3

In [16]:
ser2.to_frame()

   0
0  3
1  4
2  6
3  2

In [23]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [24]:
pd.DataFrame({"ser1": ser1, "ser2" : ser2})

   ser1  ser2
0     a     0
1     b     1
2     c     2
3     e     3
4     d     4
5     f     5
6     g     6
7     h     7
8     i     8
9     j     9
10    k    10
11    l    11
12    m    12
13    n    13
14    o    14
15    p    15
16    q    16
17    r    17
18    s    18
19    t    19
20    u    20
21    v    21
22    w    22
23    x    23
24    y    24
25    z    25

In [29]:
ser1.name = "index_name"
ser1

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
Name: index_name, dtype: object

In [33]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

In [44]:
union = pd.Series(np.union1d(ser1, ser2))
intersect = pd.Series(np.intersect1d(ser1, ser2))

union[~union.isin(intersect)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

In [48]:
ser = pd.Series(np.random.normal(10, 5, 25))
ser.describe()

state = np.random.RandomState(100)
ser = pd.Series(state.normal(10, 5, 25))
print(ser.describe())

# Solution
np.percentile(ser, q=[0, 25, 50, 75, 100])

count    25.000000
mean     10.435437
std       4.253118
min       1.251173
25%       7.709865
50%      10.922593
75%      13.363604
max      18.094908
dtype: float64

array([ 1.25117263,  7.70986507, 10.92259345, 13.36360403, 18.0949083 ])

In [81]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

In [82]:
ser.value_counts()

3    4
4    3
1    3
2    2
dtype: int64

In [83]:
ser

0     1
1     3
2     4
3     4
4     3
5     2
6     4
7     3
8     3
9     1
10    1
11    2
dtype: int64

In [84]:
print("Top 2 Freq:", ser.value_counts())
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser

Top 2 Freq: 3    4
4    3
1    3
2    2
dtype: int64

0     Other
1         3
2         4
3         4
4         3
5     Other
6         4
7         3
8         3
9     Other
10    Other
11    Other
dtype: object

In [87]:
ser = pd.Series(np.random.random(20))
pd.qcut(ser, q = [0,.1,0.2,.3,.4,.5,.6,.7,.8,.9, 1.0], 
        labels = ['one', 'two','three', 'four', 'five', 'siz', 'seven', 'eight', 'nine', 'ten'])

0      nine
1     eight
2     seven
3      nine
4      four
5       siz
6      five
7       ten
8       two
9       one
10    three
11    seven
12    eight
13    three
14      siz
15     four
16      ten
17     five
18      one
19      two
dtype: category
Categories (10, object): [one < two < three < four ... seven < eight < nine < ten]

In [90]:
ser = pd.Series(np.random.randint(1, 10, 35))
pd.DataFrame(ser.values.reshape(7,5))

   0  1  2  3  4
0  5  4  3  5  4
1  8  8  3  7  5
2  8  2  9  5  8
3  9  1  2  6  9
4  2  6  3  9  7
5  1  4  8  5  2
6  5  3  6  5  8

In [95]:
ser = pd.Series(np.random.randint(1, 10, 7))
print(ser)
print(ser[ser % 3 == 0])

0    5
1    3
2    2
3    6
4    7
5    2
6    3
dtype: int64
1    3
3    6
6    3
dtype: int64

In [96]:
print(np.argwhere(ser%3 == 0))

[[1]
 [3]
 [6]]

In [97]:
ser[ser % 3 == 0].index

Int64Index([1, 3, 6], dtype='int64')

In [98]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]
ser

0     a
1     b
2     c
3     d
4     e
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object

In [99]:
ser[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

In [100]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))
pd.DataFrame(index = ser1, columns = ser2)

     a    b    c    d    e
0  NaN  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN  NaN

In [101]:
pd.DataFrame({"ser1": ser1, "ser2": ser2})

   ser1 ser2
0     0    a
1     1    b
2     2    c
3     3    d
4     4    e

In [113]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])
[pd.Index(ser1).get_loc(i) for i in ser2]

[5, 4, 0, 8]

In [ ]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [123]:
ser.map(lambda x: x[0].upper() + x[1:])

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [124]:
ser.map(len)

0    3
1    2
2    4
3    4
dtype: int64